In [1]:
print("hiiii")

hiiii

In [1]:
import pandas as pd

In [28]:
circles = pd.read_csv('circles.csv')
df1 = pd.read_csv('bank.csv', sep=';')
df2 = pd.read_csv('bank-full.csv', sep=';')
df3 = pd.read_csv('bank-additional.csv', sep=';')
df4 = pd.read_csv('bank-additional-full.csv', sep=';')

In [23]:
df1.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [24]:
df1.shape

(4521, 17)

In [25]:
df2.shape

(45211, 17)

# df2: bank-full.csv is the correct one since its dimension matches with the assignment

In [26]:
df3.shape

(4119, 21)

In [27]:
df4.shape

(41188, 21)

In [ ]:
circles.head()

           x          y  class
0    3.15676  116.12252      6
1   16.14436   16.81660     11
2  100.31212   64.99025     53
3   -1.33773   84.81772      4
4  104.37328   62.42373     53

In [30]:
circles.shape

(10000, 3)